In [3]:
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]

In [4]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [5]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type": "District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [16]:
#List of high schools
high_schools= ["Huang High School", 
               "Figueroa High School", 
               "Shelton High School", 
               "Hernandez High School", 
               "Griffin High School",
              "Wilson High School",
              "Cabrera High School",
              "Bailey High School",
              "Holden High School",
                "Pena High School",
              "Wright High School",
              "Rodriguez High School",
              "Johnson High School",
              "Ford High School",
              "Thomas High School"]

In [17]:
# Add the Pandas dependency.
import pandas as pd

In [18]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [20]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [21]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [22]:
# Three separate list of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", 
               "Figueroa High School", 
               "Shelton High School", 
               "Hernandez High School",
              "Griffin High School"]

type_of_school = ["District",
                 "District",
                 "Charter",
                 "District",
                 "Charter"]

In [25]:
# Initialize a new DataFrame
schools_df = pd.DataFrame()

In [28]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [32]:
# Add the school_name to the new DataFrame.
schools_df["school_name"] = school_name
schools_df["type"] = type_of_school
schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [41]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id,
                     'school_name':school_name,
                     'type':type_of_school}
high_schools_dict_df = pd.DataFrame()

In [43]:
# Get the names of the columns in a DataFrame
schools_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [44]:
# Get the index of a DataFrame
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [45]:
# Get the values of a DataFrame
schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [63]:
student_data = os.path.join('.', 'Resources', 'new_student_data.csv')
student_df = pd.read_csv(student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [64]:
student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
13935,32277979,Kelly Myers,10th,Sullivan High School,62.3,37.9,Public
13936,109412748,Kimberly Burke,10th,Montgomery High School,99.5,89.8,Public
13937,16856426,Crystal Merritt,9th,Turner High School,86.3,71.1,Public
13938,88213835,Misty Wiggins,10th,Fisher High School,75.4,76.4,Public
13939,12153644,Michele Jones,11th,Chang High School,69.0,72.4,Public

In [65]:
student_df["student_name"]

0            Sarah Douglas
1        Francisco Osborne
2                Ryan Haas
3             Kathryn Mack
4          Harold Reynolds
               ...
13935          Kelly Myers
13936       Kimberly Burke
13937      Crystal Merritt
13938        Misty Wiggins
13939        Michele Jones
Name: student_name, Length: 13940, dtype: object

In [66]:
import matplotlib
matplotlib.__version__

'3.5.1'

In [1]:
items_csv = Path("items.csv")
item_df = pd.read_csv(items_csv)
item_df

NameError: name 'Path' is not defined

In [4]:
import pandas as pd
import numpy as np

daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns

   AAPL  GOOG
0  0.50  0.45
1   NaN  0.63
2  0.62  0.55

In [5]:
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
2  0.62  0.55

In [9]:
# replace the NaNs with "unkown"
daily_returns = daily_returns.fillna("Unknown")

# REplace the NaNs with 0
daily_returns = daily_returns.fillna(0)
daily_returns

      AAPL  GOOG
0      0.5  0.45
1  Unknown  0.63
2     0.62  0.55

In [7]:
#Replace the NaNs with the mean of the column
daily_returns = daily_returns.fillna(daily_returns.mean())

C:\Users\18138\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

In [8]:
daily_returns

      AAPL  GOOG
0      0.5  0.45
1  Unknown  0.63
2     0.62  0.55

In [11]:
import pandas as pd
best_actors_df = pd.DataFrame({"Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]})
best_actors_df

best_actors_df.duplicated()

0    False
1     True
2    False
dtype: bool

In [13]:
best_actors_df.duplicated().sum()

1

In [14]:
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [20]:
import pandas as pd
prices = pd.DataFrame({"price_usd": ["$0.53", "$0.22", "0.34"]})
prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [21]:
prices.dtypes

price_usd    object
dtype: object

In [25]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")
prices

prices.dtypes

price_usd    float64
dtype: object